tkh1000/mesh-vars/variants/nrf52840/promicro_dxlr30/variant.h
/*
 * variant.h - NRF52840 Pro Micro + DXLR30 / E22-900M22S (SX1262)
   * Meshtastic firmware variant
 *
 * Copyright (c) 2014-2015 Arduino LLC. All right reserved.
   * Copyright (c) 2016 Sandeep Mistry All right reserved.
 * Copyright (c) 2018, Adafruit Industries (adafruit.com)
 *
 * This library is free software; you can redistribute it and/or
 * modify it under the terms of the GNU Lesser General Public
 * License as published by the Free Software Foundation; either
 * version 2.1 of the License, or (at your option) any later version.
 */

#ifndef _VARIANT_PROMICRO_DXLR30_
#define _VARIANT_PROMICRO_DXLR30_

#ifndef PROMICRO_DXLR30
#define PROMICRO_DXLR30
#endif

/** Master clock frequency */
#define VARIANT_MCK (64000000ul)
#define USE_LFXO  // Board has 32kHz crystal for LF

#include "WVariant.h"

#ifdef __cplusplus
extern "C" {
#endif

// Number of pins defined in PinDescription array
#define PINS_COUNT           (48)
#define NUM_DIGITAL_PINS     (48)
#define NUM_ANALOG_INPUTS    (6)
#define NUM_ANALOG_OUTPUTS   (0)

// LEDs  (Pro Micro nRF52840 - TX LED on P1.10, RX LED on P1.11)
#define PIN_LED1             (42)  // P1.10 = 32+10
#ifndef LED_BUILTIN
#define LED_BUILTIN          PIN_LED1
#endif
#define LED_GREEN            PIN_LED1
#define LED_STATE_ON         0     // Active LOW

// No dedicated user button on bare Pro Micro; uncomment and wire one if needed:
// #define BUTTON_PIN        (xx)
// #define BUTTON_NEED_PULLUP

// Analog pins
#define PIN_A0  (3)
#define PIN_A1  (4)
#define PIN_A2  (28)
#define PIN_A3  (29)
#define PIN_A4  (30)
#define PIN_A5  (31)
#define PIN_A6  (0xff)
#define PIN_A7  (0xff)

static const uint8_t A0 = PIN_A0;
static const uint8_t A1 = PIN_A1;
static const uint8_t A2 = PIN_A2;
static const uint8_t A3 = PIN_A3;
static const uint8_t A4 = PIN_A4;
static const uint8_t A5 = PIN_A5;

#define ADC_RESOLUTION 14

// Other pins
#define PIN_AREF  (2)
#define PIN_NFC1  (9)
#define PIN_NFC2  (10)
static const uint8_t AREF = PIN_AREF;

// Serial1 (hardware UART on board edge)
#define PIN_SERIAL1_RX  (15)  // P0.15
#define PIN_SERIAL1_TX  (17)  // P0.17
#define PIN_SERIAL2_RX  (40)  // P1.08 - available pin for Serial2
#define PIN_SERIAL2_TX  (39)  // P1.07 - available pin for Serial2

// SPI0 - used by DXLR30 radio
#define SPI_INTERFACES_COUNT  1
#define PIN_SPI_MISO  (14)   // P0.14
#define PIN_SPI_MOSI  (16)   // P0.16
#define PIN_SPI_SCK   (13)   // P0.13

static const uint8_t SS   = (10);
static const uint8_t MOSI = PIN_SPI_MOSI;
static const uint8_t MISO = PIN_SPI_MISO;
static const uint8_t SCK  = PIN_SPI_SCK;

// I2C
#define WIRE_INTERFACES_COUNT  1
#define PIN_WIRE_SDA  (2)   // P0.02
#define PIN_WIRE_SCL  (3)   // P0.03

// QSPI Flash (optional - populate if flash chip fitted)
#define PIN_QSPI_SCK   (19)
#define PIN_QSPI_CS    (20)
#define PIN_QSPI_IO0   (21)
#define PIN_QSPI_IO1   (22)
#define PIN_QSPI_IO2   (23)
#define PIN_QSPI_IO3   (24)
#if defined(EXTERNAL_FLASH_DEVICES)
  #define EXTERNAL_FLASH_USE_QSPI
#endif

// -----------------------------------------------------------------------
// DXLR30 / E22-900M22S radio  (SX1262-compatible, 915 MHz)
//
//  Wiring (3.3V SPI0):
//    MISO  -> P0.14  pin 14
//    MOSI  -> P0.16  pin 16
//    SCK   -> P0.13  pin 13
//    NSS   -> P0.10  pin 10
//    DIO1  -> P0.09  pin  9   (interrupt)
//    BUSY  -> P0.08  pin  8
//    NRST  -> P1.06  pin 38  (P1.06 = 32+6)
// -----------------------------------------------------------------------
#define USE_SX1262

#define SX126X_CS     (10)   // P0.10
#define SX126X_DIO1   (9)    // P0.09
#define SX126X_BUSY   (8)    // P0.08
#define SX126X_RESET  (38)   // P1.06

// DIO2 drives the module's built-in RF switch
#define SX126X_DIO2_AS_RF_SWITCH

// DIO3 supplies the TCXO at 1.8V (per E22-900M22S datasheet)
#define SX126X_DIO3_TCXO_VOLTAGE  1.8

// Battery monitoring via 100k/100k divider on A5 (P0.31)
#define BATTERY_PIN                    PIN_A5
#define BATTERY_SENSE_RESOLUTION_BITS  12
#define BATTERY_SENSE_RESOLUTION       4096.0
#undef  AREF_VOLTAGE
#define AREF_VOLTAGE                   3.0
#define VBAT_AR_INTERNAL               AR_INTERNAL_3_0
#define ADC_MULTIPLIER                 2.0

// USB power monitoring
#define NRF_APM

#ifdef __cplusplus
}
#endif

#endif /* _VARIANT_PROMICRO_DXLR30_ */
